"""

Кількість ресурсів:
100 од. "Води"
50 од. "Цукру"
30 од. "Лимонного соку"
40 од. "Фруктового пюре".      
Лимонад потребує:                     
  2 од. "Води" 
  1 од. "Цукру"
  1 од. "Лимонного соку"
 Фруктовий сік потребує:                    
  1 од. "Води"
  2 од. "Фруктового пюре".    
Постановка задачі:

З обмеженнями:
1) 1A+2B≤4             2A+1B≤100             
2) 3A+2B≤12            1A+0B≤50
3) 2A+4B≤18            1A+0B≤30
4) A≥0,B≥0             0A+2B≤40
5)                      A≥0,B≥0
"""


#


import pulp

# Ініціалізація моделі
model = pulp.LpProblem("Maximize Profit", pulp.LpMaximize)

# Визначення змінних
A = pulp.LpVariable('A', lowBound=0, cat='Integer')  # Кількість Лимонаду
B = pulp.LpVariable('B', lowBound=0, cat='Integer')  # Кількість Фруктового соку
#
# # Функція цілі (Максимізація виробництва)
model += 1 * A + 1 * B, "Profit"
#
# # Додавання обмежень

model +=2 * A + 1 * B <= 100             
model +=1 * A <= 50
model +=1*A <= 30
model +=2*B<=40
# # Розв'язання моделі
model.solve()

# Вивід результатів
print("Виробляти Лимонаду:", A.varValue)
print("Виробляти Фруктоврго соку:", B.varValue)
